compressible/rhoCentralFoam/biconic25-55Run35/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
32385
(
(989.423319803825 460.556508967208 5.097439181284e-11)
(655.62852472424 305.540203113992 -1.17444115450163e-10)
(489.876919264063 228.345948166816 -7.65652888783836e-12)
(399.008664626064 186.000821641354 -3.97980839097545e-11)
(341.161033390033 159.040315951321 -3.65537755306448e-11)
(301.326819913535 140.473733409462 -1.2950048623352e-11)
(271.680067985513 126.65435016605 7.48184754398317e-12)
(248.514899372921 115.856220171987 6.19995821764392e-12)
...
)
;

boundaryField
{
    cone
    {
        type            maxwellSlipU;
        accommodationCoeff 0.85;
        Uwall           uniform (0 0 0);
        thermalCreep    on;
        curvature       on;
        refValue        nonuniform List<vector>
255
(
(3.37115877925426 1.5719971556227 1.63068197702874e-10)
(2.71360712438711 1.2653757833256 -2.11600895726952e-10)
(1.53255631280085 0.714642745212946 1.81216394422463e-11)
(0.933662176277062 0.435373822927637 -5.27437735446793e-11)
(0.616983655972557 0.287704203736428 -4.24293353408479e-11)
(0.437874419244962 0.204184195004086 -8.0634513988405e-12)
(0.330914604185556 0.154308014127092 1.0478097563831e-11)
(0.261453433055513 0.121917738084721 4.28302391907071e-12)
...
)
;
        valueFraction  nonuniform List<scalar>
255
(
0.00388739013936794
0.00624177317187908
0.00849035155805145
0.0107554856963952
0.013027374054784
0.0152855267181262
0.017572003248215
0.0198852696559785
...
)
;
        value           nonuniform List<vector>
255
(
(985.277612722112 459.442496220996 5.14101441685411e-11)
(651.482989892647 303.79150734464 -1.18032333902641e-10)
(485.697507906774 226.484467483758 -7.4375853078643e-12)
(394.704450194364 184.053707833492 -3.99373875211189e-11)
(336.7073676614 157.009224097703 -3.66303791862258e-11)
(296.713516742241 138.359785134999 -1.28753856576311e-11)
(266.899823467159 124.457431642979 7.53453345896321e-12)
(243.567733509709 113.577499415038 6.16186825136953e-12)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    freestream
    {
        type            fixedValue;
        value           uniform (2713 0 0);
    }
    centreLeft
    {
        type            symmetry;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}

// ************************************************************************* //
